<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [620]:
import pandas as pd
import psycopg2

In [621]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python 
# DBNAME = 'project_sql'
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [622]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [623]:
# текст запроса
query_3_1 = f'''select count(*)
                from public.vacancies
'''

In [624]:
# результат запроса
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\1114379196.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [625]:
# текст запроса
query_3_2 = f'''select count(*)
                from public.employers
'''

In [626]:
# результат запроса
df = pd.read_sql_query(query_3_2, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\3062646138.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [627]:
# текст запроса
query_3_3 = f'''select count(*)
                from public.areas
'''

In [628]:
# результат запроса
df = pd.read_sql_query(query_3_3, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\928149064.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [629]:
# текст запроса
query_3_4 = f'''select count(*)
                from public.industries
'''

In [630]:
# результат запроса
df = pd.read_sql_query(query_3_4, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\2101691108.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4, connection)

   count
0    294

***

In [631]:
# выводы по предварительному анализу данных

В среднем у каждого работодателя представлены две вакансии.

В каждом регионе около 35-40 вакансий.

На каждую сферу деятельности в среднем приходиться 160 вакансий и 70-80 работодателей.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [632]:
# текст запроса
query_4_1 = f'''select count(v.id) cnt, a.name area
                from public.vacancies v
                join public.areas a on v.area_id = a.id
                group by a.id
                order by 1 desc
                --limit 5
'''

In [633]:
# результат запроса
df = pd.read_sql_query(query_4_1, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\2457173557.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

      cnt                      area
0    5333                    Москва
1    2851           Санкт-Петербург
2    2112                     Минск
3    2006               Новосибирск
4    1892                    Алматы
..    ...                       ...
764     1                    Кизляр
765     1                    Джизак
766     1                    Эртиль
767     1                  Арсеньев
768     1  Тура (Красноярский край)

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [634]:
# текст запроса
query_4_2 = f'''select count(v.id) cnt
                from public.vacancies v
                where v.salary_from is not null OR v.salary_to is not null
'''

In [635]:
# результат запроса
df = pd.read_sql_query(query_4_2, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\970655580.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection)

     cnt
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [636]:
# текст запроса
query_4_3 = f'''select round(avg(v.salary_from)), round(avg(v.salary_to))
                from public.vacancies v
'''

In [637]:
# результат запроса
df = pd.read_sql_query(query_4_3, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\2500607024.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

     round     round
0  71065.0  110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [638]:
# текст запроса
query_4_4 = f'''select schedule, employment, count(id)
                from public.vacancies v
                group by schedule, employment
                order by 3 desc
                --offset 1
                --limit 1
'''

In [639]:
# результат запроса
df = pd.read_sql_query(query_4_4, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\2022935265.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [640]:
# текст запроса
query_4_5 = f'''select experience "Требуемый опыт работы", count(id) "Количество вакансий"
                from public.vacancies v
                group by experience
                order by count(id)
'''

In [641]:
# результат запроса
df = pd.read_sql_query(query_4_5, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\2316260449.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

  Требуемый опыт работы  Количество вакансий
0           Более 6 лет                 1337
1             Нет опыта                 7197
2         От 3 до 6 лет                14511
3    От 1 года до 3 лет                26152

***

In [642]:
# выводы по детальному анализу вакансий

Около 30% всех вакансий приходятся на 5 годоров.

Заработная плата указана у половины вакансий.

Средняя ЗП не менее 70000 руб., что около $1000.

Вероятность найти работу на полный день и удаленную работу наибольшая в сочетании с полной занятостю. В то время как на проектную работу и стажировку при беглом анализе - наименьшая.

Чуть более половины вакансий - требуюемый опыт от 1 год до 3 лет. Существенная прибавка идет за опыт от 3 до 6 лет. В то время как опыт свыше 6 лет требуется существенно меньшему числу работодателей. Доля вакансий Без опыта небольшая - около 15%.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [643]:
# текст запроса
query_5_1 = f'''(select e.name
                from public.employers e
                join public.vacancies v on e.id = v.employer_id
                group by e.name
                order by count(v.employer_id) desc
                limit 1)
                union all
                (select e.name
                from public.employers e
                join public.vacancies v on e.id = v.employer_id
                group by e.name
                order by count(v.employer_id) desc
                offset 4
                limit 1)
                
                
'''

In [644]:
# результат запроса
df = pd.read_sql_query(query_5_1, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\3834399874.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

            name
0         Яндекс
1  Газпром нефть

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [645]:
# текст запроса
query_5_2 = f'''select a.name, count(e.id) employers, count(v.id) vacancies
                from public.areas a
                left join public.employers e on a.id = e.area
                left join public.vacancies v on v.area_id = a.id
                group by a.name
                having count(v.id) = 0
                order by 2 desc          
'''

In [646]:
# результат запроса
df = pd.read_sql_query(query_5_2, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\2250345976.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

                             name  employers  vacancies
0                          Россия        410          0
1                       Казахстан        207          0
2              Московская область         75          0
3              Краснодарский край         19          0
4              Ростовская область         18          0
..                            ...        ...        ...
588                      Струнино          0          0
589    Славгород (Алтайский край)          0          0
590                     Сорочинск          0          0
591  Ленинский (Тульская область)          0          0
592                         Тавда          0          0

[593 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [647]:
# текст запроса
query_5_3 = f'''select e.name, count(distinct v.area_id)
                from public.vacancies v
                join public.employers e on v.employer_id = e.id
                --join public.areas a on v.area_id = a.id
                group by e.name
                order by 2 desc          
'''

In [648]:
# результат запроса
df = pd.read_sql_query(query_5_3, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\201667002.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection)

                         name  count
0                      Яндекс    181
1                  Ростелеком    152
2                  Спецремонт    116
3      Поляков Денис Иванович     88
4                   ООО ЕФИН      71
...                       ...    ...
14761                  UniSol      1
14762            UNISTORY LLC      1
14763                   UNIT6      1
14764     United Distribution      1
14765              UNITEL LLC      1

[14766 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [649]:
# текст запроса
query_5_4 = f'''select sum(count)
                from (
                        select count(e.id)
                        from public.employers e
                        left join public.employers_industries ei on e.id = ei.employer_id
                        left join public.industries i on ei.industry_id = i.id
                        where i.id is null
                        group by e.id
                ) as tbl
'''

In [650]:
# результат запроса
df = pd.read_sql_query(query_5_4, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\3493105328.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

      sum
0  8419.0

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [651]:
# текст запроса
query_5_5 = f'''select e.name, count(ei.industry_id)
                from public.employers e
                join public.employers_industries ei on e.id = ei.employer_id
                group by e.id
                having count(ei.industry_id) = 4
                order by 1
                offset 2
                limit 1
'''

In [652]:
# результат запроса
df = pd.read_sql_query(query_5_5, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\388711819.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

   name  count
0  2ГИС      4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [653]:
# текст запроса
query_5_6 = f'''select count(*)
                from public.employers_industries ei
                join public.industries i on ei.industry_id = i.id
                where i.name = 'Разработка программного обеспечения'
'''

In [654]:
# результат запроса
df = pd.read_sql_query(query_5_6, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\821628714.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_6, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [655]:
# код для получения списка городов-милионников
big_city = (
    "Москва", "Санкт-Петербург", "Новосибирск", 
    "Екатеринбург", "Казань", "Нижний Новгород", 
    "Красноярск", "Челябинск", "Самара", "Уфа", 
    "Ростов-на-Дону", "Омск", "Краснодар", 
    "Воронеж", "Пермь", "Волгоград"
)

In [656]:
# текст запроса
query_5_7 = f'''(SELECT 
                a.name,
                count(*) cnt
         from employers e
         join vacancies v on e.id = v.employer_id
         join areas a on a.id = v.area_id
            WHERE e.name = 'Яндекс' and a.name in {big_city}
            GROUP BY a.id
            ORDER BY 2 ASC)
            
            UNION ALL 

            (SELECT 
                'TOTAL',
                COUNT (*) "Общ кол-во вакансий в городах-миллионниках"
            FROM public.vacancies v
                JOIN public.employers e ON e.id = v.employer_id
                JOIN public.areas a ON a.id = v.area_id
            WHERE e.name = 'Яндекс' and a.name in {big_city})            
           
        '''

In [657]:
# результат запроса
df = pd.read_sql_query(query_5_7, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\1965596796.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_7, connection)

               name  cnt
0             TOTAL  485
1              Омск   21
2         Челябинск   22
3        Красноярск   23
4         Волгоград   24
5    Ростов-на-Дону   25
6            Казань   25
7             Пермь   25
8            Самара   26
9               Уфа   26
10        Краснодар   30
11          Воронеж   32
12      Новосибирск   35
13  Нижний Новгород   36
14     Екатеринбург   39
15  Санкт-Петербург   42
16           Москва   54

***

In [658]:
# выводы по анализу работодателей

Яндекс - лидер по количеству вакансий. В пятерке также Газпром.

Мы видим, что в регионе Россия нет вакансий.

Самая широкая региональная сеть у Яндекса, Ростелекома и Спецремонта. Скорее всего у Яндекса и Ростелекома много вакансий по удаленному формату работу.

На разработку ПО приходится 7% вакансий.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [659]:
# текст запроса
query_6_1 = f'''select count(*)
                from public.vacancies v
                where lower(v.name) like '%data%' or lower(v.name) like '%данн%'
'''

In [660]:
# результат запроса
df = pd.read_sql_query(query_6_1, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\366702258.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [661]:
query_ds = '''(lower(v.name) like '%data scientist%' or lower(v.name) like '%data science%'
                    or lower(v.name) like '%исследователь данных%' or (v.name like '%ML%'
                    and v.name not like '%HTML%')
                    or lower(v.name) like '%machine learning%' or lower(v.name) like '%машинн%обучен%')
'''

In [662]:
# текст запроса
query_6_2 = f'''select count(*)
                from public.vacancies v
                where {query_ds}
                    and (lower(v.name) like '%junior%' or v.experience like '%Нет опыта%'
                    or v.employment like '%Стажировка%')
'''

In [663]:
# результат запроса
df = pd.read_sql_query(query_6_2, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\2267038862.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [664]:
# текст запроса
query_6_3 = f'''select count(*)
                from public.vacancies v
                where {query_ds}
                    and (v.key_skills ilike '%SQL%' or v.key_skills ilike 'postgres')
'''

In [665]:
# результат запроса
df = pd.read_sql_query(query_6_3, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\3794299702.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [666]:
# текст запроса
query_6_4 = f'''select count(*)
                from public.vacancies v
                where {query_ds}
                    and (v.key_skills ilike '%python%')
'''

In [667]:
# результат запроса
df = pd.read_sql_query(query_6_4, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\4264665179.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [668]:
# текст запроса
query_6_5 = f'''select round(avg(1 + length(v.key_skills) - length(replace(v.key_skills, chr(9), ''))), 2)
                from public.vacancies v
                where {query_ds}
                and v.key_skills is not null
                
'''

In [669]:
# результат запроса
df = pd.read_sql_query(query_6_5, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\3654210517.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [670]:
# текст запроса
query_6_6 = f'''select v.experience, round(avg((coalesce(salary_from, salary_to)+coalesce(salary_to, salary_from))/2)) salary
                from public.vacancies v
                where {query_ds}
                and v.key_skills is not null
                and (v.salary_from is not null or v.salary_to is not null)
                group by v.experience
                
'''

In [671]:
# результат запроса
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\519194770.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

           experience    salary
0           Нет опыта   74643.0
1  От 1 года до 3 лет  146704.0
2       От 3 до 6 лет  243115.0

***

In [672]:
# выводы по предметному анализу

К данным относится 3,5% вакансий. Это вдвое меньше, чем на разработку ПО.

Спрос на джунов очень мал - всего 51 вакансия.

Знания SQL требуются в 200 вакансиях. Знания Python в 350 вакансиях. Мне кажется, что реальное чслов вакансий со знанием Python больше,просто по умолчанию не пишут. Могу ошибаться.

В DS в среднем нужно знать/уметь - 6-7 навыков/технологий.

# Общий вывод по проекту

In [673]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования

Всего вакансий около 50 000. В срендем на каждый регион 30-40 вакансий.

Половина вакансий с указанием ЗП, половина без. ЗП указывается на уровне не менее 70 000 руб.

Полная занятость, Полный день и Удаленная работа - предпочтительные варианты поиска работы.

Яндекс - лидер по вакансиям. Разработка ПО среди всех вакансий 7%, 3,5% - это DS. На мой взгляд это очень неплохо учитывая множество всех сфер.

В DS необходимо владеть 6-7 навыками/технологиями.

In [674]:
# доп. исследования

Вакансий, в назвнии которых Java - 5816, JavaScript - 3698, Python - 3554, Kotlin - 520, Swift - 462. Как минимум на Java приходится 5800 вакансий, следовательно изначальный поиск Разработки ПО не совсем точен (получили 3500 вакансий).

In [675]:
query_7 = f'''(select 'Java', count(v.name)
                from public.employers e
                join public.vacancies v on e.id = v.employer_id
                where (v.name ilike '%java%' and v.name not ilike '%javascript%')
                     or (v.key_skills ilike '%java%' and v.name not ilike '%javascript%'))
                union all
                (select 'Python', count(v.name)
                from public.employers e
                join public.vacancies v on e.id = v.employer_id
                where v.name ilike '%python%'
                     or v.key_skills ilike '%python%')
                union all
                (select 'JavaScript', count(v.name)
                from public.employers e
                join public.vacancies v on e.id = v.employer_id
                where v.name ilike '%javascript%'
                    or v.key_skills ilike '%javascript%')
                union all
                (select 'Kotlin', count(v.name)
                from public.employers e
                join public.vacancies v on e.id = v.employer_id
                where v.name ilike '%kotlin%'
                    or v.key_skills ilike '%kotlin%')
                union all
                (select 'Swift', count(v.name)
                from public.employers e
                join public.vacancies v on e.id = v.employer_id
                where v.name ilike '%swift%'
                    or v.key_skills ilike '%swift%')
                order by 2 desc
'''

In [676]:
df = pd.read_sql_query(query_7, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\2767996417.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_7, connection)

     ?column?  count
0        Java   5816
1  JavaScript   3698
2      Python   3554
3      Kotlin    520
4       Swift    462

In [677]:
query_8 = f'''(select a.name, v.experience, count(v.experience)
                from public.vacancies v
                join public.areas a on v.area_id = a.id
                where {query_ds}
                and a.name not in {big_city}
                group by a.name, v.experience
                order by 3 desc
                limit 10)
                union all
                (select a.name, v.experience, count(v.experience)
                from public.vacancies v
                join public.areas a on v.area_id = a.id
                where {query_ds}
                and a.name not in {big_city}
                group by a.name, v.experience
                order by 3
                limit 10)
                
'''

In [678]:
df = pd.read_sql_query(query_8, connection)
df

C:\Users\Eduard\AppData\Local\Temp\ipykernel_8380\1280661075.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_8, connection)

           name          experience  count
0        Алматы  От 1 года до 3 лет      7
1        Алматы       От 3 до 6 лет      7
2    Нур-Султан       От 3 до 6 лет      6
3         Минск  От 1 года до 3 лет      5
4         Томск       От 3 до 6 лет      5
5       Армения       От 3 до 6 лет      4
6        Рязань       От 3 до 6 лет      3
7          Кипр       От 3 до 6 лет      3
8          Баку         Более 6 лет      2
9       Армения         Более 6 лет      2
10  Владивосток           Нет опыта      1
11       Ижевск       От 3 до 6 лет      1
12      Абхазия         Более 6 лет      1
13       Бишкек         Более 6 лет      1
14       Брянск       От 3 до 6 лет      1
15   Зеленоград  От 1 года до 3 лет      1
16      Барнаул  От 1 года до 3 лет      1
17       Батуми       От 3 до 6 лет      1
18     Белгород       От 3 до 6 лет      1
19    Иннополис  От 1 года до 3 лет      1

Не счита Российских городов-миллионников, больше всего вакансий за границей (в основном опыт от 3 лет), меньше всего в регионах (и также с опытом более 3 лет). Выходит, DS лучше искать в миллионниках.